app/views/students/index.html.erb

          <div class="content">
            <% if s.courses.each do |c| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]