app/views/students/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "courses_students" ON "courses"."id" = "courses_students"."course_id" WHERE "courses_students"."student_id" = ?  [["student_id", 1]]
---
      <div class="content">
        <% if @student.courses.each do |c| %>