app/views/courses/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
      <div class="control select">
        <%= f.collection_select :category_id, Category.order(:name), :id, :name, include_blank: true %>