app/views/courses/index.html.erb

        <td><%= c.number_of_maximum_students %></td>
        <td><%= c.students.length %></td>
---
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]