app/views/courses/show.html.erb

  <header class="card-header">
    <%= link_to raw('<span class="icon">
        <i class="fa fa-arrow-left" aria-hidden="true"></i>
      </span>'), courses_path, class: 'card-header-icon' %>

    <p class="card-header-title">
      <%= @course.name %>
    </p>
  </header>
  <div class="card-content">
    <div class="content">
      <strong>Category: </strong>
      <%= @course.category.name %>
      <br/>
      <strong>Level: </strong>
      <%= @course.level %>
      <br/>
      <strong>Number of maximum students: </strong>
      <%= @course.number_of_maximum_students %>
      <br/>
      <strong>Number of students enrolled: </strong>
      <%= @course.students.length %>
---
SELECT "students".* FROM "students" INNER JOIN "courses_students" ON "students"."id" = "courses_students"."student_id" WHERE "courses_students"."course_id" = ?  [["course_id", 1]]