app/controllers/categories_controller.rb

  def set_category
    @category = Category.includes(:courses).find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = ?  [["category_id", 4]]