app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "level", "number_of_maximum_students", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "First Course"], ["level", 2], ["number_of_maximum_students", 20], ["created_at", "2017-11-19 15:34:08.525557"], ["updated_at", "2017-11-19 15:34:08.525557"], ["category_id", 1]]
---
  def create
    @course = Course.new(course_params)

    if @course.save

UPDATE "courses" SET "number_of_maximum_students" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["number_of_maximum_students", 5], ["updated_at", "2017-11-19 12:23:35.066893"], ["id", 2]]
---
  def update
    if @course.update(course_params)