app/controllers/students_controller.rb

SELECT  "categories".* FROM "categories" ORDER BY "categories"."name" ASC LIMIT ?  [["LIMIT", 1]]
---
  def attend
    @categories = Category.order(:name)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_courses
    @courses = Course.find(params[:category_id])

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Petkov 2"], ["updated_at", "2017-11-21 14:13:58.536760"], ["id", 6]]
---
  def update
    if @student.update(student_params)