app/views/categories/_form.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = 7
---

    <% if category.courses.any? %>